Revit 2027 API
FilterIntegerRule Constructor
 Constructs an instance of FilterIntegerRule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FilterIntegerRule(
	FilterableValueProvider valueProvider,
	FilterNumericRuleEvaluator evaluator,
	int ruleValue
)
Public Sub New (
	valueProvider As FilterableValueProvider,
	evaluator As FilterNumericRuleEvaluator,
	ruleValue As Integer
)
public:
FilterIntegerRule(
	FilterableValueProvider^ valueProvider,
	FilterNumericRuleEvaluator^ evaluator,
	int ruleValue
)
new :
        valueProvider : FilterableValueProvider *
        evaluator : FilterNumericRuleEvaluator *
        ruleValue : int -> FilterIntegerRule
Parameters
valueProvider FilterableValueProvider
 A pointer to a "value provider" object that will extract values from a Revit document.
evaluator FilterNumericRuleEvaluator
 A pointer to the filter rule evaluator object that implements the desired test. The built-in evaluators implement commonly used tests such as less-than, greater-than less-than-or-equal-to, equal, etc.
ruleValue Int32
 The user-supplied value against which values from a Revit document will be tested.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilterIntegerRule Class
Autodesk.Revit.DB Namespace